{
  "backend/main.mo": "Minimal Motoko canister with an empty actor.",
  "feature_evidence.json": "Feature evidence report mapping PWA install-related features to frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all frontend source files including screens, components, hooks, and utilities.",
  "frontend/DELIVERY.md": "Documentation explaining the app is a PWA with offline support and no Android APK.",
  "frontend/index.css": "Tailwind CSS base and theme variables defining light/dark color tokens and global styles.",
  "frontend/index.html": "Main HTML entry file with PWA metadata, manifest link, service worker registration, and root mounting div.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, and standalone display mode.",
  "frontend/public/sw.js": "Service worker implementing cache-first offline support for core assets.",
  "frontend/src/App.tsx": "Main React app managing navigation between screens with slide transitions and session context.",
  "frontend/src/components/AppShell.tsx": "Layout shell with header, language toggle, history button, and PWA install handling with fallback dialog.",
  "frontend/src/components/InstallOnAndroidHelp.tsx": "Dialog component showing instructions for installing the PWA on Android via browser menus.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identity loading, status flags, and logout functionality.",
  "frontend/src/hooks/usePwaInstall.ts": "Tracks PWA install prompt availability and exposes a function to trigger installation.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language state, persistence, direction handling, and a translation function for the app.",
  "frontend/src/i18n/translations.ts": "Defines French and Arabic translation dictionaries used by the i18n system.",
  "frontend/src/index.css": "Sets Tailwind base styles with custom color variables, dark mode, touch settings, and RTL support.",
  "frontend/src/lib/accessPoints.ts": "Exports static access point definitions and a helper returning the icon path.",
  "frontend/src/lib/pdf/exportToPdf.ts": "Generates a printable PDF-like HTML page for visitor and vehicle records using bilingual labels.",
  "frontend/src/lib/pdf/templates.ts": "Provides French and Arabic label templates for use in PDF generation.",
  "frontend/src/lib/storage/indexedDb.ts": "IndexedDB helpers for opening the database, saving and retrieving visitor and vehicle records, and updating exit times.",
  "frontend/src/lib/storage/types.ts": "Type definitions for VisitorRecord and VehicleRecord used in storage operations.",
  "frontend/src/lib/validation.ts": "Validation utilities for required fields, time format, and ensuring exit times are after entry times.",
  "frontend/src/lib/vehicleTypes.ts": "List of vehicle types with IDs and a helper returning the static vehicle icon path.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, and Internet Identity provider.",
  "frontend/src/screens/EntryTypeScreen.tsx": "UI screen letting users choose between visitor or vehicle entry before proceeding.",
  "frontend/src/screens/HistoryExportScreen.tsx": "Loads, filters, edits, and exports visitor and vehicle history records, including exit time updates and PDF export.",
  "frontend/src/screens/HomeScreen.tsx": "Initial setup screen for supervisor name and access point selection with validation.",
  "frontend/src/screens/SplashScreen.tsx": "Simple splash screen with fade‑in animation and branding.",
  "frontend/src/screens/VehicleFormScreen.tsx": "Form for creating vehicle entry records with validation and IndexedDB save logic.",
  "frontend/src/screens/VisitorFormScreen.tsx": "React screen that manages visitor form state, validates required/time fields, saves records to IndexedDB, and resets/navigates on success.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme colors, container settings, animations, and plugins including typography and container queries.",
  "project_state.json": "Project metadata describing app purpose, architecture, requirements, known issues, and existing implemented features."
}