{
  "backend/main.mo": "Empty Motoko actor with no exposed functionality.",
  "feature_evidence.json": "JSON report mapping implemented features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all main frontend files.",
  "frontend/DELIVERY.md": "Documentation explaining the app's PWA nature, offline features, and non-APK delivery constraints.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color tokens, themes, and layout utilities including dark mode.",
  "frontend/index.html": "HTML entry point loading the React app and registering the service worker.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, icons, colors, and display mode.",
  "frontend/public/sw.js": "Service worker providing basic offline caching for core assets and handling fetch and activation events.",
  "frontend/src/App.tsx": "Main React component controlling navigation between screens using state and slide animations.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, language toggle, optional history button, and footer.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching an authenticated or anonymous ICP backend actor using react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including login, logout, and status tracking.",
  "frontend/src/i18n/I18nProvider.tsx": "Implements a simple i18n provider with language persistence, RTL handling, and a translation function.",
  "frontend/src/i18n/translations.ts": "Contains French and Arabic translation dictionaries used by the i18n system.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for theming, dark mode, RTL support, and touch-friendly interactions.",
  "frontend/src/lib/accessPoints.ts": "Exports static access point definitions and a helper to retrieve an access point icon path.",
  "frontend/src/lib/pdf/exportToPdf.ts": "Generates a printable HTML-based PDF export for visitor and vehicle records with bilingual labels.",
  "frontend/src/lib/pdf/templates.ts": "Provides French and Arabic label templates for PDF generation.",
  "frontend/src/lib/storage/indexedDb.ts": "Implements IndexedDB operations for saving, retrieving, and updating visitor and vehicle records.",
  "frontend/src/lib/storage/types.ts": "Defines TypeScript interfaces for VisitorRecord and VehicleRecord data structures.",
  "frontend/src/lib/validation.ts": "Contains basic validation utilities for required fields and time comparisons.",
  "frontend/src/lib/vehicleTypes.ts": "Exports vehicle type definitions and a helper returning the vehicle icon path.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/screens/EntryTypeScreen.tsx": "UI screen letting users choose visitor or vehicle entry type and navigate back or to history.",
  "frontend/src/screens/HistoryExportScreen.tsx": "Loads, filters, edits, and exports visitor and vehicle history records with search and sorting.",
  "frontend/src/screens/HomeScreen.tsx": "Initial setup screen collecting supervisor name and access point before starting a session.",
  "frontend/src/screens/SplashScreen.tsx": "Displays a branded splash screen with a fade‑in animation on load.",
  "frontend/src/screens/VehicleFormScreen.tsx": "Form for entering and validating vehicle arrival data and saving records to storage.",
  "frontend/src/screens/VisitorFormScreen.tsx": "Form for entering visitor information with validation and saving to storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins for the project.",
  "project_state.json": "Defines the project’s state, requirements, architecture notes, image assets, and existing features for an offline Android app named ATHENA SURVEILLANCE. Provides high‑level app behavior, UI flow, data model expectations, and PDF export requirements."
}