{
  "kind": "build_request",
  "title": "Clarify no-APK delivery and add in-app Android installation guidance",
  "projectName": "ATHENA SURVEILLANCE",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Add an in-app “Install on Android” help surface (screen, dialog, or bottom sheet) that clearly states that no Android APK is provided and explains how to install the app as a PWA via the browser “Add to Home screen” flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "build APK file for this app"
        ]
      },
      "acceptanceCriteria": [
        "From the app UI, a user can open an “Install on Android” help view in 2 taps or fewer (e.g., from the header or footer).",
        "The help view includes explicit English text stating that the app is a web app (PWA) and that an Android APK is not available from this project.",
        "The help view provides step-by-step instructions for Android Chrome: open browser menu (⋮) → “Add to Home screen” (or “Install app”) → confirm.",
        "The help view mentions that offline use works after the first successful load while online.",
        "All new user-facing strings introduced by this requirement are in English."
      ]
    },
    {
      "id": "REQ-15",
      "text": "When the browser indicates the app is installable (PWA), show a lightweight “Install” call-to-action in the UI that triggers the native install prompt when supported, and otherwise links to the “Install on Android” help surface.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "build APK file for this app"
        ]
      },
      "acceptanceCriteria": [
        "If the browser supports the PWA install prompt, an “Install” button is shown somewhere appropriate (e.g., header menu/help) and triggers the install prompt.",
        "If the install prompt is not available, the same UI element opens the “Install on Android” help surface instead of failing silently.",
        "The install CTA and any related messaging added by this requirement are in English.",
        "This change does not break offline behavior or existing navigation flow."
      ]
    }
  ],
  "constraints": [
    "Do not claim to generate or deliver an Android APK artifact; this project is delivered as an installable offline-capable web app (PWA-like).",
    "Do not modify files under frontend/src/components/ui (read-only).",
    "Keep the backend as a single Motoko actor; no new backend services."
  ],
  "nonGoals": [
    "Generating, signing, or distributing an Android APK/AAB.",
    "Publishing to the Google Play Store.",
    "Adding native Android storage (SQLite/Room) or native Android APIs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}