{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Clarify no-APK delivery and add in-app Android PWA installation guidance",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Provide an in-app “Install on Android” help surface explaining no APK delivery and how to install as a PWA via Add to Home screen, including offline note.",
      "acceptanceCriteria": [
        "From the app UI, a user can open an “Install on Android” help view in 2 taps or fewer (e.g., from the header or footer).",
        "The help view includes explicit English text stating that the app is a web app (PWA) and that an Android APK is not available from this project.",
        "The help view provides step-by-step instructions for Android Chrome: open browser menu (⋮) → “Add to Home screen” (or “Install app”) → confirm.",
        "The help view mentions that offline use works after the first successful load while online.",
        "All new user-facing strings introduced by this requirement are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/InstallOnAndroidHelp.tsx",
          "operation": "create",
          "description": "Create a reusable help surface component (dialog/sheet content) with explicit English-only copy: no APK provided, PWA install steps for Android Chrome (⋮ → Add to Home screen/Install app → confirm), and note that offline works after the first successful online load. Use shadcn-ui primitives already in the app (e.g., Dialog content styling via existing UI components) to match the design system. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Wire the “Install on Android” help surface into the global layout so it is reachable in 2 taps or fewer from any screen (e.g., a header action that opens the help dialog). Use existing shadcn-ui Button and Dialog components (do not modify anything under frontend/src/components/ui) and ensure any new labels/tooltips are English. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Add a lightweight Install CTA that triggers the native PWA install prompt when available, otherwise opens the in-app “Install on Android” help surface.",
      "acceptanceCriteria": [
        "If the browser supports the PWA install prompt, an “Install” button is shown somewhere appropriate (e.g., header menu/help) and triggers the install prompt.",
        "If the install prompt is not available, the same UI element opens the “Install on Android” help surface instead of failing silently.",
        "The install CTA and any related messaging added by this requirement are in English.",
        "This change does not break offline behavior or existing navigation flow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePwaInstall.ts",
          "operation": "create",
          "description": "Implement a React hook that listens for the browser installability signal (beforeinstallprompt) and exposes: (1) whether the install prompt is currently available, and (2) a function to trigger the native install prompt when supported. Keep it side-effect safe and scoped to UI needs so it does not affect service worker/offline behavior."
        },
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Add an English “Install” call-to-action in the header that uses the usePwaInstall hook: when installable, trigger the native prompt; when not installable, open the existing “Install on Android” help surface. Ensure the fallback never fails silently and does not disrupt existing navigation. Use existing shadcn-ui Button/Dialog components without modifying frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}